tutorials/10.1.2.1D_2phase_4componentGas_YCO2i_0_compositionalDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-2;

vertices
(
    (0 0 0) //0
    (10 0 0) //1
    (10 3.5 0) //2
    (0 3.5 0) //3
    (0 0 3.5) //4
    (10 0 3.5) //5
    (10 3.5 3.5) //6
    (0 3.5 3.5) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    yzfaces
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (0 1 5 4)
	    (2 6 7 3)
        );
    }
);


// ************************************************************************* //
