tutorials/10.1.2.1D_2phase_4componentGas_YCO2i_0_compositionalDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blockSolver
{
    pAs
    {
        solver              BiCGStab;
        preconditioner      ILUC0;

        tolerance           1e-08;
        relTol              0.001;

        minIter             1;
        maxIter             1000;
    }
}

solvers
{
    ".*CO2"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    };
}

COUPLED
{
    nOuterCorrectors            50;
    
    residualControl
    {
        pAs
        {
            tolerance   1e-3;
        }
    }
}

relaxationFactors
{
    fields
    {}
    equations 
    {}
}


// ************************************************************************* //
